import pyproj
import math

wgs84 = pyproj.Proj("epsg:4326")
sh0 = pyproj.Proj(
    "+datum=WGS84 +proj=tmerc +lon_0=121.465472691 +lat_0=31.303175065 +x_0=0 +y_0=0 +k_0=1")
# 平移X(米)：-159.869654
# 平移Y(米)：7509.021025
# 旋转(弧度)：0.000010
# 缩放：0.999999
# 公共点数目：9
# Wgs84点0：121.234907861,31.776374972,0.000000
# Wgs84点1：121.493542250,31.722467389,0.000000
# Wgs84点2：121.877734917,31.514372778,0.000000
# Wgs84点3：121.151957861,31.325260778,0.000000
# Wgs84点4：121.477669889,31.397793139,0.000000
# Wgs84点5：121.876905333,31.324978639,0.000000
# Wgs84点6：120.901466806,31.044813778,0.000000
# Wgs84点7：121.352291139,30.721282444,0.000000
# Wgs84点8：121.822778167,30.901231667,0.000000
# 地方独立坐标系点0：-22000.000000,60000.000000,0.000000, 中误差：0.291
# 地方独立坐标系点1：2500.000000,54000.000000,0.000000, 中误差：0.227
# 地方独立坐标系点2：39000.000000,31000.000000,0.000000, 中误差：0.152
# 地方独立坐标系点3：-30000.000000,10000.000000,0.000000, 中误差：0.194
# 地方独立坐标系点4：1000.000000,18000.000000,0.000000, 中误差：0.098
# 地方独立坐标系点5：39000.000000,10000.000000,0.000000, 中误差：0.096
# 地方独立坐标系点6：-54000.000000,-21000.000000,0.000000, 中误差：0.300
# 地方独立坐标系点7：-11000.000000,-57000.000000,0.000000, 中误差：0.250
# 地方独立坐标系点8：34000.000000,-37000.000000,0.000000, 中误差：0.155
dx = -159.869654
dy = 7509.021025
rotate = 0.000010
scale = 0.999999


def wgs84_to_sh(x, y):
    x0, y0 = pyproj.transform(wgs84, sh0, y, x)
    x1 = x0*math.cos(rotate)-y0*math.sin(rotate)
    y1 = x0*math.sin(rotate)+y0*math.cos(rotate)
    x2=x1*scale+dx
    y2=y1*scale+dy
    x2=format(x2,'0.6f')
    y2=format(y2,'0.6f')
    return x2,y2


def sh_to_wgs84(x, y):
    x0=(x-dx)/scale
    y0=(y-dy)/scale
    x1 = x0*math.cos(rotate)+y0*math.sin(rotate)
    y1 = -x0*math.sin(rotate)+y0*math.cos(rotate)
    y2,x2 = pyproj.transform(sh0,wgs84, x1,y1)
    x2=format(x2,'0.9f')
    y2=format(y2,'0.9f')
    return x2,y2

if __name__=="__main__":
    print('WGS84 to SH:')
    print(wgs84_to_sh(121.234907861,31.776374972))
    print(wgs84_to_sh(121.493542250,31.722467389))
    print(wgs84_to_sh(121.877734917,31.514372778))
    print(wgs84_to_sh(121.151957861,31.325260778))
    print(wgs84_to_sh(121.477669889,31.397793139))
    print(wgs84_to_sh(121.876905333,31.324978639))
    print(wgs84_to_sh(120.901466806,31.044813778))
    print(wgs84_to_sh(121.352291139,30.721282444))
    print(wgs84_to_sh(121.822778167,30.901231667))
    print('SH to WGS84:')
    print(sh_to_wgs84(-22000.000000,60000.000000))
    print(sh_to_wgs84(2500.000000,54000.000000))
    print(sh_to_wgs84(39000.000000,31000.000000))
    print(sh_to_wgs84(-30000.000000,10000.000000))
    print(sh_to_wgs84(1000.000000,18000.000000))
    print(sh_to_wgs84(39000.000000,10000.000000))
    print(sh_to_wgs84(-54000.000000,-21000.000000))
    print(sh_to_wgs84(-11000.000000,-57000.000000))
    print(sh_to_wgs84(34000.000000,-37000.000000))